SapiGaul/Final-Assignment/STM32F746G-Disc => Smart Voltmeter => Main.c
/* USER CODE BEGIN Header */
/*******************************************************************************
  Created By: Ahmad Alvi Syahrin
						  PENS 2017
	Modified By : Andrean Rangga Kusuma
							PENS 2018
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
 *******************************************************************************
*/
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "math.h"
#include <stdio.h>
#include "stdbool.h"
#include "string.h"
#include "stm32f7xx_hal_sdram.h"
#include "stm32f7xx_hal_ltdc.h"
#include "stm32f7xx_ll_fmc.h"
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"
#include "stm32746g_discovery_sdram.h"
#include "lambangpens.h"
#include "profilku.h"
#include "mainmenuku.h"
//#include "wallpaper.h"
#include "calibrationed.h"
#include "voltagewaveform1.h"
#include "voltagewaveform2.h"
#include "voltagewaveform3.h"
#include "voltagewaveform4.h"
#include "condition.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
int hour, min, sec,msec;
int day, month, year;
char rtc [100];
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
//int key;
//key = 10000;
#define sampling_kal 1000 //moving average
#define acdc 20

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc3;
DMA_HandleTypeDef hdma_adc3;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c3;
DMA_HandleTypeDef hdma_i2c3_rx;
DMA_HandleTypeDef hdma_i2c3_tx;

LTDC_HandleTypeDef hltdc;

RTC_HandleTypeDef hrtc;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;

UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_usart6_rx;
DMA_HandleTypeDef hdma_usart6_tx;

DMA_HandleTypeDef hdma_memtomem_dma2_stream0;
SDRAM_HandleTypeDef hsdram1;

/* USER CODE BEGIN PV */

float a, b, c, d, e, f, bt,zz;
char masukan,keterangan;

double x1, x2;
float VLM, LM, NM, HM, ST, MT, LT, VST;
float r1, r2, r3, r4, r5, r6, r7, r8, r9, r10, r11;
float AAA, BBB, Kondisi, Vadc, Iadc;
int normal, interuption, sag, swell, sustained_interuption, undervoltage, overvoltage,ket;

bool awal, menu, profil, sistem, logger, kalibrasi;

float program1, program2, jeda,loop,loop1;
float Vadcnol, Vsum, Vsq[sampling_kal], Vrms, Tegangan, Teg, pengurang = 0, konv,AC,DC=1,minkal = 0,Vnom = 220;
float Iadcnol, Isum, Isq[sampling_kal], Vref, VoltageReference, teganganmasukan, kondisi;
float in1,in2,in3,in4,in5,in6,in7,in8,in9,in10,in11,in12,in13,in14,in15,in16,in17,in18,in19,in20,ACDC[acdc];
int j = 0, k = 0,l = 0, minus,tt1,tt2,tt3=0,tt4=0;
//char AC, DC;


//--------------------------------------------------------------------------------
//----------------------------------update grafik - spectrum---------------------------------
double Vg[420],Ig[420];
int h = 0, i = 0,input;

	uint8_t  lcd_status = LCD_OK;
	uint16_t get_y, get_x;
	
char Buf[30],Buf2[30],Buf3[30];
char buf_RX[100], buf_TX[100];
uint8_t rx_data;
//volatile uint16_t adc[2], Vadc, Iadc;  //tinjau ulang untuk bluetooth
__IO uint16_t adc[2]; //opsi lain
static TS_StateTypeDef  TS_State;
	uint8_t NbLoop = 1;
	#ifndef USE_FULL_ASSERT
	uint32_t    ErrorCounter = 0;
	#endif
	
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_ADC3_Init(void);
static void MX_LTDC_Init(void);
static void MX_I2C3_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM5_Init(void);
/* USER CODE BEGIN PFP */

void password(void);
void cover(void);
void main_menu(void);
void my_profil(void);
void main_system(void);
void data_logger(void);
void bluetooth(void);
void calibration(void);
void program(void);
void program_rtc(void);
void waktu(void);
void timer1(void);
void timer2(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
  RTC_TimeTypeDef sTime = {0};
  RTC_DateTypeDef sDate = {0};

void program_rtc()
{
	{
HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN); 
HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
day = sDate.Date;
month = sDate.Month;
year = sDate.Year;
hour = sTime.Hours;
min = sTime.Minutes;
sec = sTime.Seconds;
msec = sTime.SubSeconds;
}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	/////COBA/////
	if(htim->Instance==TIM2) // pembacaan sensor
	{
		Vadc = adc[0]  ; //nilai adc tegangan asli
		Vadcnol = Vadc - 1600 - minkal ;//1601.08;//- 1589.58; //- 1760; //nilai adc tegangan dikembalikan ke titik 0
		
		Iadc = adc[1]; //nilai adc VoltageReference asli
		Iadcnol = Iadc; //- 2042; //nilai adc VoltageReference dikembalikan ke titik 0
		
		Vsum -= Vsq[k];
		Isum -= Isq[k];
	  		
		//sensor tegangan//		
		Vsq[k] = pow(Vadcnol,2); //nilai kuadrat adc tegangan titik nol ke - k
		
		Vsum += Vsq[k];	//nilai total adc tegangan sampai - k
										
