SapiGaul/Final-Assignment/STM32F746G-Disc => Smart Voltmeter => Main.c
		Vrms = sqrt((Vsum/sampling_kal)); //nilai adc tegangan rms
		if(Vrms<0)
			Vrms = 0;
		
//		if(0<Vrms<Vrms)
//		{
//			pengurang = Vrms;
//		}		
		 		Teg = Vrms - pengurang ;
		
//		if (AC == 1)
//		{
//			if (Teg <= 0)
//			Tegangan =0;	
		//program ac/dc otomatis//
		
//		if (in3>0 && in4==0)
//		{
//			in4=adc[0];
//			HAL_Delay(5);
//		}
//		if (in2>0 && in3==0)
//		{
//			in3=adc[0];
//			HAL_Delay(5);
//		}
//		if (in1>0 && in2==0)
//		{
//			in2=adc[0];
//			HAL_Delay(5);
//		}
//		if(in1==0)
//		{
//		in1=adc[0];
//		HAL_Delay(5);
//		}
//		if (in1<100 || in2<100 || in3<100 || in4<100)
//		{	
//		AC=1;
//		DC=0;
//		in1=0;
//		in2=0;
//		in3=0;
//		in4=0;	
//		}
//			if (in1>=100 && in2>100 && in3>100 && in4>100)
//			{
//				AC=0;
//				DC=1;
//				in1=0;
//				in2=0;
//				in3=0;
//				in4=0;
//			}				
			

		if(DC==0)
		{
		if(0<Teg && Teg<=0.803)
		{
			Tegangan = Teg*3 + 0.2872;
			konv = 1;
		}
		if(0.803<Teg && Teg<=2.024)
		{
			Tegangan = Teg*0.9001 + 1.2642;
			konv = 2;
		}
		if(2.024<Teg && Teg<=8.094)
		{
			Tegangan = Teg*0.6602 + 1.8105;
			konv = 3;
		}
		if(8.094 <Teg && Teg<=9.728)
		{
			Tegangan = Teg*0.5692 + 2.4933;
			konv = 4;
		}
		if(Teg>9.728 && Teg <63)
		{
			Tegangan = Teg*0.5193 - 0.258;
			konv = 5;
		}
		if(Teg>=63)
		{
			Tegangan = Teg*0.517 + 3.6467;
			konv = 5;
		}
	 }
//	}
		
		if (DC == 1)
		{
//			Tegangan = Teg;
		if(Teg<=1.1)
		{
			Tegangan = Teg*1.5114 + 1.2408;
			konv = 1;
		}
		if(1.1<Teg && Teg<=9.9)
		{
			Tegangan = Teg*0.61 + 2.3285;
			konv = 2;
		}
		if(Teg > 9.9)
		{
			Tegangan = Teg*0.5002 + 3.5409;
			konv = 3;
		}
		
	}
	
		//		Tegangan = Teg;
		//	Tegangan = (0.3194 * Vrms) - 0.4208;
	//		Tegangan = (0,5172 * Vrms) - 827,58; //DC
	//			Tegangan = (16.901 * Vrms) - 27030; //AC

		//sensor VoltageReference//
		Isq[k] = pow(Iadcnol,2); //nilai kuadrat adc VoltageReference titik nol ke - k
		
		Isum += Isq[k];	//nilai total adc VoltageReference sampai - k
										
		Vref = sqrt((Isum/sampling_kal)); //nilai adc VoltageReference rms
		if(Vref<0)
			Vref = 0;
		
		VoltageReference = Vref;//(0.010002*Vref)- 0.004929;
		
		k++;							
		if(k>=sampling_kal)
		{
			j = 1;
			k = 0;
		}
	}
	
	
	/////PROGRAM SENSING AC/DC OTOMATIS////////
	if(htim->Instance==TIM3)
	{
//		l++;
//		if (l<=20)
//		{
//			ACDC[l]= Vadc;
//			
//			if (ACDC[1] > 1598)
//				in1=1;
//			if (ACDC[2] > 1598)
//				in2=1;
//			if (ACDC[3] > 1598)
//				in3=1;
//			if (ACDC[4] > 1598)
//				in4=1;
//			if (ACDC[5] > 1598)
//				in5=1;
//			if (ACDC[6] > 1598)
//				in6=1;
//			if (ACDC[7] > 1598)
//				in7=1;
//			if (ACDC[8] > 1598)
//				in8=1;
//			if (ACDC[9] > 1598)
//				in9=1;
//			if (ACDC[10] > 1598)
//			{	
//			in10=1;
//				if (in1==0 && in2==0 && in3==0 && in4==0 && in5==0 && in6==0 && in7==0 && in8==0 && in9==0 && in10==0)
//				{
//					DC=1;
//					minus =1;
//				}
//				if (in1==1 || in2==1 || in3==1 || in4==1 || in5==1 || in6==1 || in7==1 || in8==1 || in9==1 || in10==1)
//				{
//					DC=0;
//					minus =0;
//				
//					if (in1==1 && in2==1 && in3==1 && in4==1 && in5==1 && in6==1 && in7==1 && in8==1 && in9==1 && in10==1)
//					{
//						DC=1;
//						minus =0;
//					}
//				}
//			}
//			
//			
//			if (l==20)
//			{
//				l=0;
//			 in1 = in2= in3 = in4 = in5 =0;
//			}
//		}
		//titik 0 ketika ADC antara 1598-1605
		//program ac/dc otomatis//
		
//		if (in3>0 && in4==0)
//		{
//			in4=adc[0];
//			HAL_Delay(5);
//		}
//		if (in2>0 && in3==0)
//		{
//			in3=adc[0];
//			HAL_Delay(5);
//		}
//		if (in1>0 && in2==0)
//		{
//			in2=adc[0];
//			HAL_Delay(5);
//		}
//		if(in1==0)
//		{
//		in1 = adc[0];
//		HAL_Delay(5);
//		}
//		if (in1<1600 || in2<1600 || in3<1600 || in4<1600)
//		{	
//		AC=1;
//		DC=0;
//		in1=0;
//		in2=0;
//		in3=0;
//		in4=0;	
//		}
//			if (in1>=100 && in2>100 && in3>100 && in4>100)
//			{
//				AC=0;
//				DC=1;
//				in1=0;
//				in2=0;
//				in3=0;
//				in4=0;
//			}	
 
	}

	if(htim->Instance==TIM4) // pembacaan sensor
	{
		program_rtc();
		if (DC==0)
		{
			
		if (Tegangan <= 0.1*Vnom)
		{
			timer1();
			tt4 = 1;
		}
		if (Tegangan <= 0.9*Vnom && Tegangan > 0.1*Vnom)
		{
			timer1();
			tt4 = 2;
		}
		if (Tegangan >= 1.1*Vnom)
		{
			timer1();
			tt4 = 3;
		}
		if (Tegangan < 1.1*Vnom && Tegangan > 0.9*Vnom)
		{
			tt1 = 0;
			tt2 = 0;
			tt3 = 0;
			tt4 = 0;
		}
		
		}
		if (DC==1)
		{
			
			tt1 = 0;
			tt2 = 0;
			tt3 = 0;
			tt4 = 0;
		}
//		waktu();
	}
	
	if(htim->Instance==TIM5)
	{
		
	}
}



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
	
	if( BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize())!=TS_OK)
		Error_Handler();
	
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_DMA2D_Init();
  MX_FMC_Init();
  MX_ADC3_Init();
  MX_LTDC_Init();
  MX_I2C3_Init();
  MX_TIM2_Init();
  MX_TIM1_Init();
  MX_TIM3_Init();
  MX_USART6_UART_Init();
  MX_RTC_Init();
  MX_TIM4_Init();
  MX_TIM5_Init();
  /* USER CODE BEGIN 2 */
				 
	lcd_status = BSP_LCD_Init();//get LCD status
	#define LCD_FRAME_BUFFER		SDRAM_DEVICE_ADDR  //address FB

	BSP_LCD_LayerDefaultInit(LTDC_ACTIVE_LAYER,LCD_FRAME_BUFFER);//layer initialitation
	BSP_LCD_SelectLayer(LTDC_ACTIVE_LAYER);//layer selection
	BSP_LCD_SetTransparency(LTDC_ACTIVE_LAYER,199);//set layer transparancy
	BSP_LCD_DisplayOn();//turn on the Lcd
	HAL_ADC_Start_DMA(&hadc3,(uint32_t*)&adc,2);//DMA ADC start
	HAL_UART_Receive_IT (&huart6, &rx_data,1);
//	HAL_UART_Receive_DMA (&huart6,(uint8_t*) &rx_data,2);
	
	awal = 1;
	menu = 0;
	profil = 0;
	kalibrasi = 0;
	sistem = 0;
	logger = 0;
	a = 0, b = 0, c = 0, d = 0, e = 0, f = 0;

	
