SapiGaul/Final-Assignment/STM32F746G-Disc => Smart Voltmeter => Main.c
	normal = 1;
	interuption = 2;
	sag = 3;
	swell = 4;
	sustained_interuption = 5;
	undervoltage = 6;
	overvoltage = 7;
	
	jeda = 0;
	loop = 0;
//	password();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
		
//				if (in3>0 && in4==0)
//		{
//			in4=Vadc;
////			HAL_Delay(5);
//		}
//		if (in2>0 && in3==0)
//		{
//			in3=Vadc;
////			HAL_Delay(5);
//		}
//		if (in1>0 && in2==0)
//		{
//			in2=Vadc;
////			HAL_Delay(5);
//		}
//		if(in1==0)
//		{
//		in1=Vadc;
////		HAL_Delay(5);
//		}
//		if (in1<100 || in2<100 || in3<100 || in4<100)
//		{	
//		AC=1;
//		DC=0;
//		in1=0;
//		in2=0;
//		in3=0;
//		in4=0;	
//		}
//			if (in1>=100 && in2>100 && in3>100 && in4>100)
//			{
//				AC=0;
//				DC=1;
//				in1=0;
//				in2=0;
//				in3=0;
//				in4=0;
//			}
		BSP_TS_ResetTouchData(&TS_State);
		
		BSP_TS_GetState(&TS_State);
		get_y = TS_State.touchY[0];
		get_x = TS_State.touchX[0];

		if (a==0)					//cover
		{
			if (awal==1) 		
			{
				HAL_TIM_Base_Start_IT(&htim4);
				HAL_TIM_Base_Stop_IT(&htim2);
				HAL_TIM_Base_Stop_IT(&htim3);
				cover();
//				program_rtc();

				awal = 0;
				
			}
			
			if (271 <= get_x && get_x <= (271+46) && 187 <= get_y  && get_y <= (187+46))
				a = 1;
				
			if (176 <= get_x && get_x <= (176+46) && 187 <= get_y  && get_y <= (187+46))
			{
				profil = 1;
				a = 2;
			}
				waktu();			
		}
		
		if (a==1)					//mainmenu
	
		{
			
			if (awal==0)
			{
				HAL_TIM_Base_Start_IT(&htim2);
				HAL_TIM_Base_Start_IT(&htim3);
				main_menu();

				awal = 1 ;
				
			}
			
			if (10 <= get_x && get_x <= 60 && 1 <= get_y  && get_y <= 55)
				a = 0;
					
			
			if	(218 <= get_x && get_x <= 218+69 && 113  <= get_y  && get_y <= 113+46)
			{
				sistem = 1;
				a = 3;
			}
			
			if (359 <= get_x && get_x <= 359+69 && 113 <= get_y  && get_y <= 113+46)
			{
				logger = 1;
				a = 4 ;
			}
			
			if	(113 <= get_x && get_x <= 113+69 && 113 <= get_y  && get_y <= 113+46)
			{
				kalibrasi = 1;
				a = 5;
			}
			waktu();
		}
		
		if (a==2)					//profil
		{
			if (profil==1)
			{
				my_profil();
				profil = 0;
			}
			
			if (10 <= get_x && get_x <= 60 && 1 <= get_y  && get_y <= 55)
			{
				awal = 1;
				a = 0;
			}
		}
		
		if (a==3)				//mainsystem
		{
			b = 0;
			c = 0;
			if (sistem==1)
			{
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna 
		BSP_LCD_DrawLine(40,35,40,215);  // sumbu VERTIKAL
		BSP_LCD_DrawLine(40,125,465,125); // sumbu HORIZONTAL				
		BSP_LCD_SetTextColor(LCD_COLOR_LIGHTBLUE);
		BSP_LCD_FillRect(0,220,160,60);
		BSP_LCD_FillRect(320,220,160,60);
		BSP_LCD_FillRect(160,220,160,60);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_FillRect(0,220,480,2);
		BSP_LCD_SetBackColor(LCD_COLOR_LIGHTBLUE);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetFont(&Font20);
		BSP_LCD_DisplayStringAt(0,230,(uint8_t*)"GELOMBANG TEGANGAN MASUKAN",CENTER_MODE);
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetFont(&Font12);
		BSP_LCD_DisplayStringAt(8,20,(uint8_t*)"   v",LEFT_MODE);
		BSP_LCD_DisplayStringAt(12,55,(uint8_t*)"400",LEFT_MODE);
		BSP_LCD_DisplayStringAt(12,97,(uint8_t*)"200",LEFT_MODE);
		BSP_LCD_DisplayStringAt(5,120,(uint8_t*)"   0",LEFT_MODE);
		BSP_LCD_DisplayStringAt(5,143,(uint8_t*)"-200",LEFT_MODE);
		BSP_LCD_DisplayStringAt(5,171,(uint8_t*)"-400",LEFT_MODE);
		BSP_LCD_DisplayStringAt(465,132,(uint8_t*)"t",LEFT_MODE);
		BSP_LCD_DisplayStringAt(445,8,(uint8_t*)"Back",LEFT_MODE);
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetFont(&Font16); //setting ukuran tulisan
		BSP_LCD_DisplayStringAt(0,12,(uint8_t*)"Voltage Waveform",CENTER_MODE);		
				for (sistem =1;sistem>0;sistem++)
				{
				main_system();
//				sistem = 0;
					BSP_TS_ResetTouchData(&TS_State);
		
		BSP_TS_GetState(&TS_State);
		get_y = TS_State.touchY[0];
		get_x = TS_State.touchX[0];
			if (400 <= get_x && get_x <= 480 && 1 <= get_y  && get_y <= 55)
			{
				awal = 0;
				a = 1;
				 break;//coba
			}
			sistem = 0;
		}
	}
//						if (365 <= get_x && get_x <= 460 && 205 <= get_y  && get_y <= 265)
//			{
//				sistem = 1;
//				 //coba
//			}
					
//			if (400 <= get_x && get_x <= 480 && 1 <= get_y  && get_y <= 55)
//			{
//				awal = 0;
//				// break; //coba
//				a = 1;
//			}
		}
		
		if (a==4)				//datalogger
		{
			b = 0;
			c = 0;
			if (logger==1)
			{
				data_logger();
				logger = 0;
			}
						
			if (400 <= get_x && get_x <= 480 && 1 <= get_y  && get_y <= 55)
			{
				awal = 0;
				a = 1;
			}
			if (20 <= get_x && get_x <= 100 && 80 <= get_y  && get_y <= 250)
			{
//				for(bt=0;bt>20;bt++)
				
//				bt =1;

//				if (bt==1)
//				{
					bluetooth();
					HAL_Delay (100);
//				}	
//					bt = 0;
//					logger =1;
				
			}
				
		}
		
		if (a==5)				//kalibrasi
		{
			b = 0;
			c = 0;
			if (kalibrasi==1)
			{
				HAL_TIM_Base_Stop_IT(&htim3);
				calibration();
				kalibrasi = 0;
			}
			
			if (10 <= get_x && get_x <= 60 && 1 <= get_y  && get_y <= 55)
			{
				awal = 0;
				a = 1;
			}
			
			if (260 <= get_x && get_x <= 355 && 205 <= get_y  && get_y <= 265)
			{
				pengurang = pengurang - 0.01;
			}			
			
			if (365 <= get_x && get_x <= 460 && 205 <= get_y  && get_y <= 265)
			{
				pengurang = pengurang + 0.01;
			}
			if (260 <= get_x && get_x <= 355 && 5 <= get_y  && get_y <= 65)
			{
				minkal = minkal - 0.01;
			}			
			
			if (365 <= get_x && get_x <= 460 && 5 <= get_y  && get_y <= 65)
			{
				minkal = minkal + 0.01;
			}
			if (20 <= get_x && get_x <= 115 && 205 <= get_y  && get_y <= 265)
			{
				AC = 1;
				DC = 0;
			}			
			
			if (125 <= get_x && get_x <= 220 && 205 <= get_y  && get_y <= 265)
			{
				DC = 1;
				AC = 0;
			}
			
			if (125 <= get_x && get_x <= 220 && 155 <= get_y  && get_y <= 200)
			{
				minus =0;
			}
			if (20 <= get_x && get_x <= 115 && 155 <= get_y  && get_y <= 200)
			{
				minus =1;
			}
			if (261 <= get_x && get_x <= 261+188 && 79 <= get_y  && get_y <= 79+40)
			{
				Vnom = Tegangan ;
			}
			
			
			program();
//			timer2();
//			if (400 <= get_x && get_x <= 480 && 0 <= get_y  && get_y <= 55)
//			{
//				awal = 0;
//				a = 1;
//			}
			}	
		}
		
    /* USER CODE END WHILE */

