SapiGaul/Final-Assignment/STM32F746G-Disc => Smart Voltmeter => Main.c
}

/* FMC initialization function */
static void MX_FMC_Init(void)
{

  /* USER CODE BEGIN FMC_Init 0 */

  /* USER CODE END FMC_Init 0 */

  FMC_SDRAM_TimingTypeDef SdramTiming = {0};

  /* USER CODE BEGIN FMC_Init 1 */

  /* USER CODE END FMC_Init 1 */

  /** Perform the SDRAM1 memory initialization sequence
  */
  hsdram1.Instance = FMC_SDRAM_DEVICE;
  /* hsdram1.Init */
  hsdram1.Init.SDBank = FMC_SDRAM_BANK1;
  hsdram1.Init.ColumnBitsNumber = FMC_SDRAM_COLUMN_BITS_NUM_8;
  hsdram1.Init.RowBitsNumber = FMC_SDRAM_ROW_BITS_NUM_12;
  hsdram1.Init.MemoryDataWidth = FMC_SDRAM_MEM_BUS_WIDTH_16;
  hsdram1.Init.InternalBankNumber = FMC_SDRAM_INTERN_BANKS_NUM_4;
  hsdram1.Init.CASLatency = FMC_SDRAM_CAS_LATENCY_1;
  hsdram1.Init.WriteProtection = FMC_SDRAM_WRITE_PROTECTION_DISABLE;
  hsdram1.Init.SDClockPeriod = FMC_SDRAM_CLOCK_DISABLE;
  hsdram1.Init.ReadBurst = FMC_SDRAM_RBURST_ENABLE;
  hsdram1.Init.ReadPipeDelay = FMC_SDRAM_RPIPE_DELAY_0;
  /* SdramTiming */
  SdramTiming.LoadToActiveDelay = 2;
  SdramTiming.ExitSelfRefreshDelay = 6;
  SdramTiming.SelfRefreshTime = 4;
  SdramTiming.RowCycleDelay = 6;
  SdramTiming.WriteRecoveryTime = 2;
  SdramTiming.RPDelay = 2;
  SdramTiming.RCDDelay = 2;

  if (HAL_SDRAM_Init(&hsdram1, &SdramTiming) != HAL_OK)
  {
    Error_Handler( );
  }

  /* USER CODE BEGIN FMC_Init 2 */

  /* USER CODE END FMC_Init 2 */
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOK_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();
  __HAL_RCC_GPIOJ_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();

}

/* USER CODE BEGIN 4 */

void password()
{
//		x = 480 5 - 475 = 470
//		y = 272 5 - 267 = 262
		BSP_LCD_Clear(LCD_COLOR_BLACK);
		
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_FillRect(5,5,470,262);
		
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //GARIS
		BSP_LCD_FillRect(0,60,480,2);
		BSP_LCD_FillRect(260,60,2,207);
		BSP_LCD_FillRect(267,65,100,98);
		BSP_LCD_FillRect(372,65,100,98);
		BSP_LCD_FillRect(267,168,100,98);
		BSP_LCD_FillRect(372,168,100,98);
		BSP_LCD_FillRect(86,60,2,207);
		BSP_LCD_FillRect(172,60,2,207);
	
		BSP_LCD_SetTextColor(LCD_COLOR_LIGHTGRAY);
		BSP_LCD_FillRect(5,62,255,205);
} 

void cover()
{
		BSP_LCD_Clear(LCD_COLOR_WHITE);
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(317,61,163,45);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DrawRect(317,61,163,45);

	//	BSP_LCD_SetTextColor(LCD_COLOR_WHITE); //MENGATUR WARNA KOTAK PADA BAGIAN ATAS
//		BSP_LCD_FillRect(0,0,480,60); //MENGATUR KOORDINAT KOTAK PADA BAGIAN ATAS
	
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_FillRect(0,60,480,2);
	
		BSP_LCD_SetTextColor(LCD_COLOR_CYAN);
		BSP_LCD_FillCircle(199,209,23);
		BSP_LCD_SetTextColor(LCD_COLOR_LIGHTBLUE);
		BSP_LCD_FillCircle(294,209,23);
		BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
		BSP_LCD_DrawCircle(189,209,23);
		BSP_LCD_DrawCircle(284,209,23);
	
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetFont(&Font12); //setting ukuran tulisan
		BSP_LCD_DisplayStringAt(178,238,(uint8_t*)"Profil",LEFT_MODE);
		BSP_LCD_DisplayStringAt(267,238,(uint8_t*)"Main Menu",LEFT_MODE); 
//	int hh;
//	for(hh=0; hh<20 ;hh++){
//			BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
//			BSP_LCD_DrawLine(0,170+hh,400,272+hh);
//		
//	}	
	
	//	BSP_LCD_FillRect(0,63,480,2);
	
		BSP_LCD_DrawBitmap(425,6,(uint8_t*)lambangpens);

    BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna pada tulisan
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna text
	  BSP_LCD_SetFont(&Font20); //setting ukuran tulisan
		BSP_LCD_DisplayStringAt(28,10,(uint8_t*)"RANCANG BANGUN", LEFT_MODE);
		BSP_LCD_DisplayStringAt(28,31,(uint8_t*)"VOLTMETER CERDAS", LEFT_MODE);
		BSP_LCD_DisplayStringAt(20,42,(uint8_t*)"", LEFT_MODE);
					 
//	  BSP_LCD_SetBackColor(LCD_COLOR_LIGHTBLUE); 
//		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
//		BSP_LCD_SetFont(&Font16);
//		BSP_LCD_DisplayStringAt(0,228,(uint8_t*)"D3 TEKNIK ELEKTRO INDUSTRI",CENTER_MODE);
//		BSP_LCD_DisplayStringAt(0,243,(uint8_t*)"POLITEKNIK ELEKTRONIKA NEGERI SURABAYA",CENTER_MODE);
//		BSP_LCD_DisplayStringAt(0,258,(uint8_t*)"SURABAYA 2020/2021",CENTER_MODE);
		
//		BSP_LCD_SetTextColor(LCD_COLOR_DARKRED);
//		BSP_LCD_SetFont(&Font12);
//		BSP_LCD_DisplayStringAt(6,72,(uint8_t*)"LOCK",LEFT_MODE);
    
//		BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna text	
//		BSP_LCD_DrawBitmap(0,127,(uint8_t*)wallpaper);
//		BSP_LCD_DrawBitmap(176,187,(uint8_t*)profilku);
//		BSP_LCD_DrawBitmap(271,187,(uint8_t*)mainmenuku);
//		BSP_LCD_DrawRect(99,95,75,75); //menu 1
//		BSP_LCD_DrawRect(299,95,75,75); //menu 4


	}

void main_menu()
{
		BSP_LCD_Clear(LCD_COLOR_WHITE);
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(317,61,163,45);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DrawRect(317,61,163,45);

//		BSP_LCD_DrawBitmap(328,0,(uint8_t*)condition);
//		BSP_LCD_DrawBitmap(328,0,(uint8_t*)condition2);
//		BSP_LCD_DrawBitmap(328,0,(uint8_t*)condition3);
//		BSP_LCD_DrawBitmap(328,0,(uint8_t*)condition4);
//		BSP_LCD_DrawBitmap(164,0,(uint8_t*)voltagewaveform1);
//		BSP_LCD_DrawBitmap(164+78,0,(uint8_t*)voltagewaveform2);
//		BSP_LCD_DrawBitmap(164,136,(uint8_t*)voltagewaveform3);
//		BSP_LCD_DrawBitmap(164+78,136,(uint8_t*)voltagewaveform4);	
//		BSP_LCD_DrawBitmap(0,0,(uint8_t*)calibrationed);
//		BSP_LCD_DrawBitmap(0,0,(uint8_t*)calibrationed2);
//		BSP_LCD_DrawBitmap(0,0,(uint8_t*)calibrationed3);
//		BSP_LCD_DrawBitmap(0,0,(uint8_t*)calibrationed4);	
	//		BSP_LCD_SetTextColor(LCD_COLOR_WHITE); //MENGATUR WARNA KOTAK PADA BAGIAN ATAS
//		BSP_LCD_FillRect(0,0,480,60); //MENGATUR KOORDINAT KOTAK PADA BAGIAN ATAS
		BSP_LCD_DrawBitmap(425,6,(uint8_t*)lambangpens);		
		BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
		BSP_LCD_FillCircle(110,136,23);
		BSP_LCD_SetTextColor(LCD_COLOR_LIGHTGREEN);
		BSP_LCD_FillCircle(241,136,23);
		BSP_LCD_SetTextColor(LCD_COLOR_LIGHTBLUE);
		BSP_LCD_FillCircle(382,136,23);
		
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_DrawCircle(87,136,23);
		BSP_LCD_DrawCircle(218,136,23);
		BSP_LCD_DrawCircle(359,136,23);
//	
//		BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
//		BSP_LCD_FillRect(0,63,480,2);
//	
//		BSP_LCD_DrawBitmap(425,6,(uint8_t*)lambangpens);

    BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna pada tulisan
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna text
		BSP_LCD_DrawRect(6,20,38,18);
	  BSP_LCD_SetFont(&Font20); //setting ukuran tulisan
		BSP_LCD_DisplayStringAt(0,38,(uint8_t*)"MAIN MENU", CENTER_MODE);
		BSP_LCD_SetFont(&Font12);
		BSP_LCD_DisplayStringAt(12,24,(uint8_t*)"Back",LEFT_MODE);
      		
//		BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna text
//		BSP_LCD_DrawRect(28,115,80,60); //menu 1
//		BSP_LCD_DrawRect(143,115,80,60); //menu 2
//		BSP_LCD_DrawRect(258,115,80,60); //menu 3
//		BSP_LCD_DrawRect(373,115,80,60); //menu 4

		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetFont(&Font12); //setting ukuran tulisan
	//	BSP_LCD_DisplayStringAt(19,229,(uint8_t*)"Setting",LEFT_MODE);
		BSP_LCD_DisplayStringAt(100,162,(uint8_t*)"Data",LEFT_MODE);
		BSP_LCD_DisplayStringAt(214,162,(uint8_t*)"Gelombang",LEFT_MODE);
		BSP_LCD_DisplayStringAt(359,162,(uint8_t*)"Logger",LEFT_MODE);
		BSP_LCD_DisplayStringAt(255,205,(uint8_t*)"",LEFT_MODE);
		BSP_LCD_DisplayStringAt(19,229,(uint8_t*)"",LEFT_MODE); 	
}	

void my_profil()
{	
		BSP_LCD_Clear(LCD_COLOR_WHITE);
//		BSP_LCD_SetTextColor(LCD_COLOR_WHITE); //MENGATUR WARNA KOTAK PADA BAGIAN ATAS
//		BSP_LCD_FillRect(0,0,480,60); //MENGATUR KOORDINAT KOTAK PADA BAGIAN ATAS
		
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_FillRect(0,60,480,2);
	
//		BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
//		BSP_LCD_FillRect(0,63,480,2);
	
		BSP_LCD_DrawBitmap(425,6,(uint8_t*)lambangpens);
	
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna pada tulisan
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna text
		BSP_LCD_DrawRect(6,10,38,18);
	  BSP_LCD_SetFont(&Font16); //setting ukuran tulisan
		BSP_LCD_DisplayStringAt(0,12,(uint8_t*)"DEPARTEMEN ELEKTRO", CENTER_MODE);
		BSP_LCD_DisplayStringAt(0,32,(uint8_t*)"POLITEKNIK ELEKTRONIKA NEGERI SURABAYA", CENTER_MODE);
		BSP_LCD_SetFont(&Font12);
		BSP_LCD_DisplayStringAt(12,14,(uint8_t*)"Back",LEFT_MODE);

		BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna pada tulisan
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna text 	
		BSP_LCD_DrawRect(25,70,62,62);
		BSP_LCD_DrawBitmap(25,70,(uint8_t*)voltagewaveform1);					
		BSP_LCD_DrawRect(25,138,62,62);
		BSP_LCD_DrawBitmap(25,138,(uint8_t*)voltagewaveform2);	
		BSP_LCD_DrawRect(25,206,62,62);
		BSP_LCD_DrawBitmap(25,206,(uint8_t*)voltagewaveform3);	
		BSP_LCD_DrawRect(100,70,368,60); 
		BSP_LCD_DrawRect(100,138,368,60);
		BSP_LCD_DrawRect(100,206,368,60);
		
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetFont(&Font16);
		BSP_LCD_DisplayStringAt(101,78,(uint8_t*)" Andrean Rangga Kusuma",LEFT_MODE);
		BSP_LCD_DisplayStringAt(101,93,(uint8_t*)" 3 D3 Elektro Industri A",LEFT_MODE);
	//	BSP_LCD_DisplayStringAt(101,108,(uint8_t*)" Kedungsumur, Krembung, Sidoarjo",LEFT_MODE);
					
		BSP_LCD_DisplayStringAt(101,148,(uint8_t*)" DOSEN PEMBIMBING 1",LEFT_MODE);
		BSP_LCD_DisplayStringAt(101,163,(uint8_t*)" Eka prasetyono, S.ST., M.T.",LEFT_MODE);
	//	BSP_LCD_DisplayStringAt(101,178,(uint8_t*)" NIP. 19831122.201012.1.004",LEFT_MODE);
			
		BSP_LCD_DisplayStringAt(101,216,(uint8_t*)" DOSEN PEMBIMBING 2",LEFT_MODE);
		BSP_LCD_DisplayStringAt(101,231,(uint8_t*)" Putu Agus Mahadi Putra,S.T.,M.T. ",LEFT_MODE);
	//	BSP_LCD_DisplayStringAt(101,246,(uint8_t*)" NIP. 19910119.201803.1.001",LEFT_MODE);
}

void main_system()
{
//		BSP_LCD_Clear(LCD_COLOR_WHITE);
//		BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna 
//		BSP_LCD_DrawLine(40,125,465,125); // sumbu HORIZONTAL
//		BSP_LCD_DrawLine(40,35,40,215);  // sumbu VERTIKAL
//	
//		BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
//		BSP_LCD_FillRect(0,220,160,60);
//		BSP_LCD_FillRect(320,220,160,60);
//	
//		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
//		BSP_LCD_FillRect(160,220,160,60);
//		BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna
//		BSP_LCD_SetFont(&Font12);
//		BSP_LCD_DisplayStringAt(8,20,(uint8_t*)"   v",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(12,38,(uint8_t*)"400",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(12,79,(uint8_t*)"200",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(5,120,(uint8_t*)"   0",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(5,161,(uint8_t*)"-200",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(5,202,(uint8_t*)"-400",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(465,132,(uint8_t*)"t",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(445,8,(uint8_t*)"Back",LEFT_MODE);
//		BSP_LCD_SetFont(&Font16); //setting ukuran tulisan
//		BSP_LCD_DisplayStringAt(0,12,(uint8_t*)"Voltage Waveform",CENTER_MODE);
	
//		for(i=0;i<3;i++)
//		while(1)
//		{
//		BSP_LCD_Clear(LCD_COLOR_WHITE);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna 
		BSP_LCD_DrawLine(40,125,465,125); // sumbu HORIZONTAL
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_FillRect(41,35,424,89);
		BSP_LCD_FillRect(41,126,424,89);
//		BSP_LCD_DrawLine(40,35,40,215);  // sumbu VERTIKAL
	
//		BSP_LCD_SetTextColor(LCD_COLOR_LIGHTBLUE);
//		BSP_LCD_FillRect(0,220,160,60);
//		BSP_LCD_FillRect(320,220,160,60);
//	
//		BSP_LCD_SetTextColor(LCD_COLOR_LIGHTBLUE);
//		BSP_LCD_FillRect(160,220,160,60);
//		BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna
//		BSP_LCD_SetFont(&Font12);
//		BSP_LCD_DisplayStringAt(8,20,(uint8_t*)"   v",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(12,38,(uint8_t*)"400",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(12,79,(uint8_t*)"200",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(5,120,(uint8_t*)"   0",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(5,161,(uint8_t*)"-200",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(5,202,(uint8_t*)"-400",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(465,132,(uint8_t*)"t",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(445,8,(uint8_t*)"Back",LEFT_MODE);
//		BSP_LCD_SetFont(&Font16); //setting ukuran tulisan
//		BSP_LCD_DisplayStringAt(0,12,(uint8_t*)"Voltage Waveform",CENTER_MODE);			
			///////////////Update Data Untuk Grafik////////////////////////////
//		sprintf(buf_TX,"Vrms = %.2f\r\n",Tegangan);
//		HAL_UART_Transmit(&huart6, (uint8_t*) buf_TX, strlen(buf_TX),500);
		
//		if (awal==0)
//			{
//				
//				break; //coba
//			}
		
		for(h=419;h>=0;h--)
			{
				Vg[h]=(adc[0]*300/4095)-50;
  	  HAL_Delay(1);
			}
					
			///////////////////Tampilkan Grafik ////////////////////////////////
			for(h=418;h>=0;h--)
			{
		
				BSP_LCD_SetTextColor(LCD_COLOR_BLUE); 
				BSP_LCD_DrawLine(40+419-h, 193-Vg[h], 40+419-h, 193-Vg[h+1]);
			}
//			if (h==418)
//			{
//				
//				break; //coba
//			}
			
			HAL_Delay (300);
//			if (awal==0)
//			{
//				break;
//			}	
			i = 0;
//		}  
			
