SapiGaul/Final-Assignment/STM32F746G-Disc => Smart Voltmeter => Main.c
}	

void data_logger()
{	
		BSP_LCD_Clear(LCD_COLOR_CYAN);
		BSP_LCD_SetBackColor(LCD_COLOR_CYAN); //setting background warna pada tulisan
    BSP_LCD_SetTextColor(LCD_COLOR_BLUE); //setting warna text
		BSP_LCD_SetFont(&Font16);
		BSP_LCD_DisplayStringAt(416,14,(uint8_t*)"Back",LEFT_MODE);
		BSP_LCD_FillRect(9,70,463,194);
		BSP_LCD_SetTextColor(LCD_COLOR_CYAN);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_FillRect(20,80,80,170);
		BSP_LCD_DrawRect(110,80,350,170);
		BSP_LCD_DisplayStringAt(230,90,(uint8_t*)"KETERANGAN",LEFT_MODE);
		BSP_LCD_DisplayStringAt(115,115,(uint8_t*)"#Tekan tombol Start Untuk memu-",LEFT_MODE);
		BSP_LCD_DisplayStringAt(125,135,(uint8_t*)"lai RECORD data ke Smartphone",LEFT_MODE);
		BSP_LCD_DisplayStringAt(115,160,(uint8_t*)"Data yang terkirim :",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(125,180,(uint8_t*)"selesai",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(115,205,(uint8_t*)"#Keluar dari mode LOGGER untuk",LEFT_MODE);
//		BSP_LCD_DisplayStringAt(125,225,(uint8_t*)"memilih menu lain",LEFT_MODE);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_DrawRect(20,80,80,170);
		BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
		BSP_LCD_DrawRect(8,69,464,194);
		BSP_LCD_DrawRect(9,70,462,192);
		BSP_LCD_SetFont(&Font24);
		BSP_LCD_SetBackColor(LCD_COLOR_CYAN);
		BSP_LCD_DisplayStringAt(0,20,(uint8_t*)"DATA LOGGER",CENTER_MODE);
		BSP_LCD_DisplayStringAt(0,41,(uint8_t*)"(Serial Mode)",CENTER_MODE);
		BSP_LCD_DisplayStringAt(50,110,(uint8_t*)"S",LEFT_MODE);
		BSP_LCD_DisplayStringAt(50,130,(uint8_t*)"T",LEFT_MODE);	
		BSP_LCD_DisplayStringAt(50,150,(uint8_t*)"A",LEFT_MODE);	
		BSP_LCD_DisplayStringAt(50,170,(uint8_t*)"R",LEFT_MODE);	
		BSP_LCD_DisplayStringAt(50,190,(uint8_t*)"T",LEFT_MODE);
}

void calibration ()
{
//		BSP_LCD_Clear(LCD_COLOR_LIGHTBLUE);
//		BSP_LCD_SetTextColor(LCD_COLOR_WHITE); //MENGATUR WARNA KOTAK PADA BAGIAN ATAS
//		BSP_LCD_FillRect(0,0,480,60); //MENGATUR KOORDINAT KOTAK PADA BAGIAN ATAS
//		
//		BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
//		BSP_LCD_FillRect(0,60,480,3);
//	
//		BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
//		BSP_LCD_FillRect(0,63,480,2);
//	
//		BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna pada tulisan
//    BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna text
//		BSP_LCD_SetFont(&Font16); //setting ukuran tulisan
//		BSP_LCD_DisplayStringAt(0,38,(uint8_t*)"SENSOR CALIBRATION", CENTER_MODE);
//		BSP_LCD_SetFont(&Font12);
//		
//		BSP_LCD_DrawRect(435,20,38,18);
//		BSP_LCD_DisplayStringAt(440,24,(uint8_t*)"Back",LEFT_MODE);
//		BSP_LCD_DrawBitmap(6,6,(uint8_t*)lambangpens);

		BSP_LCD_Clear(LCD_COLOR_WHITE);
//		BSP_LCD_SetTextColor(LCD_COLOR_WHITE); //MENGATUR WARNA KOTAK PADA BAGIAN ATAS
//		BSP_LCD_FillRect(0,0,480,60); //MENGATUR KOORDINAT KOTAK PADA BAGIAN ATAS
		
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_FillRect(0,60,480,2);
	
//		BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
//		BSP_LCD_FillRect(0,63,480,2);
	
		BSP_LCD_DrawBitmap(425,6,(uint8_t*)lambangpens);

    BSP_LCD_SetBackColor(LCD_COLOR_WHITE); //setting background warna pada tulisan
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK); //setting warna text
		BSP_LCD_DrawRect(6,20,38,18);
	  BSP_LCD_SetFont(&Font16); //setting ukuran tulisan
		BSP_LCD_DisplayStringAt(0,38,(uint8_t*)"DATA", CENTER_MODE);
		BSP_LCD_SetFont(&Font12);
		BSP_LCD_DisplayStringAt(12,24,(uint8_t*)"Back",LEFT_MODE);
		
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_FillRect(250,70,210,83);
		BSP_LCD_FillRect(250,155,210,83);
	
//    BSP_LCD_SetTextColor(LCD_COLOR_WHITE); 
//		BSP_LCD_FillRect(9,90,463,160);
				
		BSP_LCD_SetTextColor(LCD_COLOR_LIGHTBLUE);
		BSP_LCD_FillRect(21,71,209,56);
		BSP_LCD_FillRect(21,128,209,26);
		BSP_LCD_FillRect(251,155,209,20);
		BSP_LCD_FillRect(262,80,186,38);
		
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DrawRect(8,64,464,185);
    BSP_LCD_DrawRect(9,65,462,183);
		BSP_LCD_DrawRect(20,70,210,162);
//		BSP_LCD_DrawRect(20,127,1,1);
		BSP_LCD_DrawRect(250,70,210,162);
		BSP_LCD_FillRect(20,155,210,83);
		
		BSP_LCD_FillRect(144,76,80,46);
		
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_DrawRect(143,75,82,48);
		BSP_LCD_DrawRect(261,79,188,40);
		BSP_LCD_DrawLine(250,127,460,127);
		
//		BSP_LCD_SetTextColor(LCD_COLOR_RED);
//		BSP_LCD_FillRect(260,205,95,60); //a
//		BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
//		BSP_LCD_FillRect(365,205,95,60); //a
		
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_LIGHTBLUE);
		BSP_LCD_SetFont(&Font16);
		BSP_LCD_DisplayStringAt(25,73,(uint8_t*)"TEGANGAN :",LEFT_MODE);
		BSP_LCD_DisplayStringAt(298,158,(uint8_t*)"Keterangan",LEFT_MODE);
		BSP_LCD_SetFont(&Font12);
		BSP_LCD_DisplayStringAt(305,85,(uint8_t*)"Tekan untuk set",LEFT_MODE);
		BSP_LCD_DisplayStringAt(325,99,(uint8_t*)"V.Nominal",LEFT_MODE);
		
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
			BSP_LCD_SetFont(&Font16);
			sprintf((char*)Buf3,"---------------");
			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
			
}

void program ()
{
		jeda++;
		if (jeda>=1000)
		{
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_LIGHTBLUE);
			BSP_LCD_SetFont(&Font16);
			sprintf((char*)Buf2,"V.ADC     = %.0f", Vadc);
			BSP_LCD_DisplayStringAt(30,134,(uint8_t*)Buf2,LEFT_MODE);
			
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
			BSP_LCD_SetFont(&Font16);
			sprintf((char*)Buf2,"V.Nominal = %.0f   ", Vnom);
			BSP_LCD_DisplayStringAt(251,134,(uint8_t*)Buf2,LEFT_MODE);
//			sprintf((char*)Buf2,"V.ADC.RMS = %.2f", Vrms);
//			BSP_LCD_DisplayStringAt(30,175,(uint8_t*)Buf2, LEFT_MODE);
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
			BSP_LCD_SetFont(&Font24);
			sprintf((char*)Buf2,"%.2f", Tegangan);
			BSP_LCD_DisplayStringAt(80,175,(uint8_t*)Buf2, LEFT_MODE);
			
			
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
			BSP_LCD_SetFont(&Font16);
			sprintf((char*)Buf2,"Volt");
			BSP_LCD_DisplayStringAt(100,215,(uint8_t*)Buf2, LEFT_MODE);
//			sprintf((char*)Buf3,"Tegangan AC %.0f", konv );//teganganmasukan); //%.0f
//			BSP_LCD_DisplayStringAt(260,145,(uint8_t*)Buf3,LEFT_MODE);
//			sprintf((char*)Buf3,"Teg = %.2f", Teg);
//			BSP_LCD_DisplayStringAt(260,175,(uint8_t*)Buf3, LEFT_MODE);
//			sprintf((char*)Buf3,"Vref = %.2f", VoltageReference);
//			BSP_LCD_DisplayStringAt(260,145,(uint8_t*)Buf3, LEFT_MODE);
//			sprintf((char*)Buf3,"Vradc = %.2f", Iadcnol);
//			BSP_LCD_DisplayStringAt(260,205,(uint8_t*)Buf3, LEFT_MODE);
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
			BSP_LCD_SetFont(&Font24);
			if (DC == 0)
			{
			sprintf((char*)Buf3,"AC ", konv );//teganganmasukan); //%.0f
			BSP_LCD_DisplayStringAt(167,89,(uint8_t*)Buf3,LEFT_MODE);
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
			BSP_LCD_SetFont(&Font16);
	if (tt4 == 0)
	{
			sprintf((char*)Buf3,"Normal         ");
			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
			
