SapiGaul/Final-Assignment/STM32F746G-Disc => Smart Voltmeter => Main.c
	}
	if (tt4 == 1 && tt3 >60)
	{
			sprintf((char*)Buf3,"S. Interruption");
			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
			
	}
	if (tt4 == 2 && tt3 >60)
	{
			
			sprintf((char*)Buf3,"Undervoltage   ");
			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
			
	}
	if (tt4 == 3 && tt3 >60)
	{
			sprintf((char*)Buf3,"Overvoltage    ");
			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
			
	}
				
//			if (Tegangan <= 22)
//			{
//			sprintf((char*)Buf3,"S. Interruption", VoltageReference);
//			BSP_LCD_DisplayStringAt(260,175,(uint8_t*)Buf3, LEFT_MODE);
//			}
//			if (Tegangan > 22 && Tegangan <= 198)
//			{
//			sprintf((char*)Buf3,"Undervoltage   ", VoltageReference);
//			BSP_LCD_DisplayStringAt(260,175,(uint8_t*)Buf3, LEFT_MODE);
//			}
//			if (Tegangan > 198 && Tegangan <= 242)
//			{
//			sprintf((char*)Buf3,"Normal         ", VoltageReference);
//			BSP_LCD_DisplayStringAt(260,175,(uint8_t*)Buf3, LEFT_MODE);
//			}
//			if (Tegangan > 242 && Tegangan <= 400)
//			{
//			sprintf((char*)Buf3,"Overvoltage    ", VoltageReference);
//			BSP_LCD_DisplayStringAt(260,175,(uint8_t*)Buf3, LEFT_MODE);
//			}			
		}	
			if (DC == 1)
			{
			sprintf((char*)Buf3,"DC" );//teganganmasukan); //%.0f
			BSP_LCD_DisplayStringAt(167,89,(uint8_t*)Buf3,LEFT_MODE);
//			sprintf((char*)Buf3,"                ", VoltageReference);
//			BSP_LCD_DisplayStringAt(260,175,(uint8_t*)Buf3, LEFT_MODE);
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
			BSP_LCD_SetFont(&Font24);
				if(minus==1)
			{
				sprintf((char*)Buf2,"-");
				BSP_LCD_DisplayStringAt(55,175,(uint8_t*)Buf2, LEFT_MODE);
			}
			if(minus==0)
			{
				sprintf((char*)Buf2," ");
				BSP_LCD_DisplayStringAt(55,175,(uint8_t*)Buf2, LEFT_MODE);
			}
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
			BSP_LCD_SetFont(&Font16);
			sprintf((char*)Buf3,"---------------");
			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
			
			}
			
			
	
			BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
			BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
			BSP_LCD_SetFont(&Font16);
			sprintf((char*)rtc,"%d:%d:%d   ",hour, min,sec); 
			BSP_LCD_DisplayStringAt(290,5,(uint8_t*)rtc,LEFT_MODE);
		
//			sprintf((char*)Buf3,"Vref     = %.2f", VoltageReference);
//			BSP_LCD_DisplayStringAt(260,205,(uint8_t*)Buf3, LEFT_MODE);
			//	sprintf((char*)Buf3,"Kondisi = %.2f", Vref);
		//	BSP_LCD_DisplayStringAt(260,175,(uint8_t*)Buf3, LEFT_MODE);
		//	sprintf((char*)Buf3,"I.RMS     = %.2f", VoltageReference);
		//	BSP_LCD_DisplayStringAt(260,205,(uint8_t*)Buf3, LEFT_MODE);
			
			jeda = 0;
		//	HAL_Delay(200);
		}
}


void bluetooth ()
{
	
//		BSP_LCD_Clear(LCD_COLOR_LIGHTBLUE);
//		BSP_LCD_SetTextColor(LCD_COLOR_RED); //MENGATUR WARNA KOTAK PADA BAGIAN ATAS
//		BSP_LCD_FillRect(0,0,480,60);
//	loop1=0;
//	for (loop1=0;loop1>=50;loop++)
//{
	if (DC==0)
	{
		
		if (tt4 ==0)
		{
		sprintf(buf_TX,"Vrms = %.2f (AC) || %.2f\n %d:%d\n Vnom = %.0f\n Keterangan : NORMAL\n",Tegangan,Vadc,sec,msec,Vnom );
		HAL_UART_Transmit_IT(&huart6, (uint8_t*) buf_TX, strlen(buf_TX));
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(124,205,320,42);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_SetFont(&Font16);
		sprintf((char*)Buf2,"Vrms = %.2f (AC) || %.2f",Tegangan,Vadc);
		BSP_LCD_DisplayStringAt(125,190,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"%d:%d Vnom = %.0f",min,sec,Vnom);
		BSP_LCD_DisplayStringAt(125,205,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"Keterangan : NORMAL");
		BSP_LCD_DisplayStringAt(125,220,(uint8_t*)Buf2, LEFT_MODE);
		}
		if (tt4 == 1 && tt3 >60)
	{
		sprintf(buf_TX,"Vrms = %.2f (AC) || %.2f\n %d:%d\n Vnom = %.0f\n Keterangan : S.INTERRUPTION\n",Tegangan,Vadc,sec,msec,Vnom );
		HAL_UART_Transmit_IT(&huart6, (uint8_t*) buf_TX, strlen(buf_TX));
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(124,205,320,42);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_SetFont(&Font16);
		sprintf((char*)Buf2,"Vrms = %.2f (AC) || %.2f",Tegangan,Vadc);
		BSP_LCD_DisplayStringAt(125,190,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"%d:%d Vnom = %.0f",min,sec,Vnom);
		BSP_LCD_DisplayStringAt(125,205,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"Keterangan : S.INTERRUPTION");
		BSP_LCD_DisplayStringAt(125,220,(uint8_t*)Buf2, LEFT_MODE);
	}
	if (tt4 == 2 && tt3 >60)
	{
		sprintf(buf_TX,"Vrms = %.2f (AC) || %.2f\n %d:%d\n Vnom = %.0f\n Keterangan : UNDERVOLTAGE\n",Tegangan,Vadc,sec,msec,Vnom );
		HAL_UART_Transmit_IT(&huart6, (uint8_t*) buf_TX, strlen(buf_TX));
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(124,205,320,42);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_SetFont(&Font16);
		sprintf((char*)Buf2,"Vrms = %.2f (AC) || %.2f",Tegangan,Vadc);
		BSP_LCD_DisplayStringAt(125,190,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"%d:%d Vnom = %.0f",min,sec,Vnom);
		BSP_LCD_DisplayStringAt(125,205,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"Keterangan : UNDERVOLTAGE");
		BSP_LCD_DisplayStringAt(125,220,(uint8_t*)Buf2, LEFT_MODE);
	}
	if (tt4 == 3 && tt3 >60)
	{	
		sprintf(buf_TX,"Vrms = %.2f (AC) || %.2f\n %d:%d\n Vnom = %.0f\n Keterangan : OVERVOLTAGE\n",Tegangan,Vadc,sec,msec,Vnom );
		HAL_UART_Transmit_IT(&huart6, (uint8_t*) buf_TX, strlen(buf_TX));
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(124,205,320,42);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_SetFont(&Font16);
		sprintf((char*)Buf2,"Vrms = %.2f (AC) || %.2f",Tegangan,Vadc);
		BSP_LCD_DisplayStringAt(125,190,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"%d:%d Vnom = %.0f",min,sec,Vnom);
		BSP_LCD_DisplayStringAt(125,205,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"Keterangan : OVERVOLTAGE");
		BSP_LCD_DisplayStringAt(125,220,(uint8_t*)Buf2, LEFT_MODE);
	}
	if (tt4 == 1 && tt3 <60)
	{
		sprintf(buf_TX,"Vrms = %.2f (AC) || %.2f\n %d:%d\n Vnom = %.0f\n Keterangan : ------\n",Tegangan,Vadc,sec,msec,Vnom );
		HAL_UART_Transmit_IT(&huart6, (uint8_t*) buf_TX, strlen(buf_TX));
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(124,205,320,42);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_SetFont(&Font16);
		sprintf((char*)Buf2,"Vrms = %.2f (AC) || %.2f",Tegangan,Vadc);
		BSP_LCD_DisplayStringAt(125,190,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"%d:%d Vnom = %.0f",min,sec,Vnom);
		BSP_LCD_DisplayStringAt(125,205,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"Keterangan : ------");
		BSP_LCD_DisplayStringAt(125,220,(uint8_t*)Buf2, LEFT_MODE);
	}
	if (tt4 == 2 && tt3 <60)
	{
		sprintf(buf_TX,"Vrms = %.2f (AC) || %.2f\n %d:%d\n Vnom = %.0f\n Keterangan : ------\n",Tegangan,Vadc,sec,msec,Vnom );
		HAL_UART_Transmit_IT(&huart6, (uint8_t*) buf_TX, strlen(buf_TX));
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(124,205,320,42);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_SetFont(&Font16);
		sprintf((char*)Buf2,"Vrms = %.2f (AC) || %.2f",Tegangan,Vadc);
		BSP_LCD_DisplayStringAt(125,190,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"%d:%d Vnom = %.0f",min,sec,Vnom);
		BSP_LCD_DisplayStringAt(125,205,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"Keterangan : ------");
		BSP_LCD_DisplayStringAt(125,220,(uint8_t*)Buf2, LEFT_MODE);
	}
	if (tt4 == 3 && tt3 <60)
	{
		sprintf(buf_TX,"Vrms = %.2f (AC) || %.2f\n %d:%d\n Vnom = %.0f\n Keterangan : ------\n",Tegangan,Vadc,sec,msec,Vnom );
		HAL_UART_Transmit_IT(&huart6, (uint8_t*) buf_TX, strlen(buf_TX));
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(124,205,320,42);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_SetFont(&Font16);
		sprintf((char*)Buf2,"Vrms = %.2f (AC) || %.2f",Tegangan,Vadc);
		BSP_LCD_DisplayStringAt(125,190,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"%d:%d Vnom = %.0f",min,sec,Vnom);
		BSP_LCD_DisplayStringAt(125,205,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"Keterangan : ------");
		BSP_LCD_DisplayStringAt(125,220,(uint8_t*)Buf2, LEFT_MODE);
	}
	}
	if (DC==1)
	{
		sprintf(buf_TX,"Vrms = %.2f (DC) || %.2f\n %d:%d\n Vnom = %.0f\n Keterangan : ------\n",Tegangan,Vadc,sec,msec,Vnom );
		HAL_UART_Transmit_IT(&huart6, (uint8_t*) buf_TX, strlen(buf_TX));
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(124,205,320,42);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		BSP_LCD_SetFont(&Font16);
		sprintf((char*)Buf2,"Vrms = %.2f (DC) || %.2f",Tegangan,Vadc);
		BSP_LCD_DisplayStringAt(125,190,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"%d:%d Vnom = %.0f",min,sec,Vnom);
		BSP_LCD_DisplayStringAt(125,205,(uint8_t*)Buf2, LEFT_MODE);
		sprintf((char*)Buf2,"Keterangan : ------\n");
		BSP_LCD_DisplayStringAt(125,220,(uint8_t*)Buf2, LEFT_MODE);
		
