SapiGaul/Final-Assignment/STM32F746G-Disc => Smart Voltmeter => Main.c
	}
//		HAL_Delay(2);
//}
	
}

void waktu ()
{
	loop++;
	if (loop>=1)
	{

	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
	BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
	
	BSP_LCD_SetFont(&Font16);
	sprintf((char*)rtc,"%d-%d-%d   ",day, month,year);
	BSP_LCD_DisplayStringAt(320,64,(uint8_t*)rtc,LEFT_MODE);
		sprintf((char*)rtc,"%d:%d:%d:%d   ",hour, min,sec,msec); 
	BSP_LCD_DisplayStringAt(320,84,(uint8_t*)rtc,LEFT_MODE);
		loop =0;
	}
}

void timer1 ()
{
	tt1 = sec;
	if (tt2 != tt1)
	{
	tt3 = tt3+1;
		tt2 = tt1;
	}		
		
}

void timer2 ()
{
//			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
//			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
//			BSP_LCD_SetFont(&Font16);
//	if (tt4 == 0)
//	{
//			sprintf((char*)Buf3,"Normal         ");
//			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
//	}
//	if (tt4 == 1 && tt3 >60)
//	{
//			sprintf((char*)Buf3,"S. Interruption");
//			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
//	}
//	if (tt4 == 2 && tt3 >60)
//	{
//			sprintf((char*)Buf3,"Undervoltage   ");
//			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
//	}
//	if (tt4 == 3 && tt3 >60)
//	{
//			sprintf((char*)Buf3,"Overvoltage    ");
//			BSP_LCD_DisplayStringAt(260,185,(uint8_t*)Buf3, LEFT_MODE);
//	}
}

/* USER CODE END 4 */

/* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();
  /** Initializes and configures the Region and the memory to be protected 
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x20010000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_16MB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
